package org.languagetool.language.tig;

import org.junit.Test;
import org.junit.runner.RunWith;
import org.junit.runners.Parameterized;

import java.util.Arrays;
import java.util.Collection;
import java.util.List;

import static org.junit.Assert.assertArrayEquals;

@RunWith(Parameterized.class)
public class TigreWordTokenizerTest {
  private String input;
  private String[] expected;
  private TigreWordTokenizer tokenizer = new TigreWordTokenizer();

  public TigreWordTokenizerTest(String input, String[] expected) {
    this.input = input;
    this.expected = expected;
  }

  @Parameterized.Parameters
  public static Collection<Object[]> parameters() {
    return Arrays.asList(new Object[][]{
      {
        "ህግየ እግል ትጠወር ወምን ግም ዲብ ግም ዲብ ትትወረስ እግል ትንበር።",
        new String[]{"ህግየ", " ", "እግል", " ", "ትጠወር", " ", "ወምን", " ", "ግም", " ", "ዲብ", " ", "ግም", " ", "ዲብ", " ", "ትትወረስ", " ", "እግል", " ", "ትንበር", "።"}
      }, {
      "ናቅሰተ ዲብ ተአምም ወጭዊታ ዲብ ተአረቴዕ ወተዐግል እግል ቲጊስ ገአት ምንገብእ እግል ትትከተብ በ፣ ክቱብ ለበ ሂጋ ህዬ ክምሰለ ቅርድ ትሩድ ወሕጡጥ ለበ ዕጨት እግል ልትወሰፍ ቀድር፣ ህግያነ ትግራይትመ ሐቴ ምነ ታሪክ ቅዱም ለበን ሀገጊ ዐድናታ፣ ትግራይት ምን ዘመን ቅዱም እግል ትትከተብ ክምሰል አምበተት ታሪክ ለሓኬ፣ እሊ ምን ሰነት 1860ታት ወሐር ለትከተበ አክትበት ትግራይት ሰኒ ሑድ ምንማቱ ለእተ ወቀት ለሀይ ለዐለት ህግያነ አው ከሊማትነእግል ነሕንፍል አተቅደሬነ፣ እሊ ምን ምእት አክትበት ለኢበዜሕ አክተበተ ህዬ ምን ልውሕድመ እት ከርሱ ለህለ ታሪክ ትግራይት ለሸሬሕ።",
      new String[]{
        "ናቅሰተ", " ", "ዲብ", " ", "ተአምም", " ", "ወጭዊታ", " ", "ዲብ", " ", "ተአረቴዕ", " ", "ወተዐግል", " ", "እግል", " ", "ቲጊስ", " ", "ገአት", " ", "ምንገብእ", " ", "እግል", " ", "ትትከተብ", " ", "በ", "፣", " ", "ክቱብ", " ", "ለበ", " ",
        "ሂጋ", " ", "ህዬ", " ", "ክምሰለ", " ", "ቅርድ", " ", "ትሩድ", " ", "ወሕጡጥ", " ", "ለበ", " ", "ዕጨት", " ", "እግል", " ", "ልትወሰፍ", " ", "ቀድር", "፣", " ", "ህግያነ", " ", "ትግራይትመ", " ", "ሐቴ", " ", "ምነ", " ", "ታሪክ", " ",
        "ቅዱም", " ", "ለበን", " ", "ሀገጊ", " ", "ዐድናታ", "፣", " ", "ትግራይት", " ", "ምን", " ", "ዘመን", " ", "ቅዱም", " ", "እግል", " ", "ትትከተብ", " ", "ክምሰል", " ", "አምበተት", " ", "ታሪክ", " ", "ለሓኬ", "፣", " ", "እሊ", " ",
        "ምን", " ", "ሰነት", " ", "1", "8", "6", "0", "ታት", " ", "ወሐር", " ", "ለትከተበ", " ", "አክትበት", " ", "ትግራይት", " ", "ሰኒ", " ", "ሑድ", " ", "ምንማቱ", " ", "ለእተ", " ", "ወቀት", " ", "ለሀይ", " ", "ለዐለት", " ", "ህግያነ", " ", "አው", " ",
        "ከሊማትነእግል", " ", "ነሕንፍል", " ", "አተቅደሬነ", "፣", " ", "እሊ", " ", "ምን", " ", "ምእት", " ", "አክትበት", " ", "ለኢበዜሕ", " ", "አክተበተ", " ", "ህዬ", " ", "ምን", " ", "ልውሕድመ", " ", "እት", " ", "ከርሱ", " ", "ለህለ", " ",
        "ታሪክ", " ", "ትግራይት", " ", "ለሸሬሕ", "።"
      }
    }, {
      "እብ አሳስለ ምን ዮም 11 አስክ 12 ናይ ወሬሕ 8 ሰነት 2007 ዲብ አስመረ እት ቃዐት ሀገር እብ ወዛረት አዕላም እንዴ ትነዘመ ለገብአ መሕበር ጎማት ትግራይት ዕግል እብ አሳስለ አርፈዔናተ መስኡልየት።",
      new String[]{"እብ", " ", "አሳስለ", " ", "ምን", " ", "ዮም", " ", "1", "1", " ", "አስክ", " ", "1", "2", " ", "ናይ", " ", "ወሬሕ", " ", "8", " ", "ሰነት", " ", "2", "0", "0", "7", " ", "ዲብ", " ", "አስመረ", " ", "እት", " ", "ቃዐት", " ", "ሀገር", " ", "እብ", " ", "ወዛረት", " ", "አዕላም", " ", "እንዴ", " ", "ትነዘመ", " ", "ለገብአ", " ", "መሕበር", " ", "ጎማት", " ", "ትግራይት", " ", "ዕግል", " ", "እብ", " ", "አሳስለ", " ", "አርፈዔናተ", " ", "መስኡልየት", "።",}
    }, {
      "ከእንዴ አትሌነ ትግራይት ምን ምዶል እግል ትትከተብ አሰብዴት?",
      new String[]{"ከእንዴ", " ", "አትሌነ", " ", "ትግራይት", " ", "ምን", " ", "ምዶል", " ", "እግል", " ", "ትትከተብ", " ", "አሰብዴት", "?"}
    }, {
      "ከደን ኢለአፈግራሀ፣ ወምን ትትከሬ አስክ ሐራስ ምን ቤት-ሕርስ ትፈግር ኢለአቀስናሀ፣ እሳት ሐራስ ክል-ዶል ለትትደገል እሳት እት ገብእ።",
      new String[]{"ከደን", " ", "ኢለአፈግራሀ", "፣", " ", "ወምን", " ", "ትትከሬ", " ", "አስክ", " ", "ሐራስ", " ", "ምን", " ", "ቤት", "-", "ሕርስ", " ", "ትፈግር", " ", "ኢለአቀስናሀ", "፣", " ", "እሳት", " ", "ሐራስ", " ", "ክል", "-", "ዶል", " ", "ለትትደገል", " ", "እሳት", " ", "እት", " ", "ገብእ", "።"}
    }, {
      "ሚ ትገብእ? አምዕ’ለ ሐራስ ተአወልውላተ።",
      new String[]{"ሚ", " ", "ትገብእ", "?", " ", "አምዕ", "’", "ለ", " ", "ሐራስ", " ", "ተአወልውላተ", "።"}
    }, {
      "‘‘ንኡሽ ልዕቤ ወእሳት ትቅሰን፣ ንኡሽ ልዕቤ ወእሳት ትቅሰን’’ እት ልብሎ ቀንጾ፣ ሐቆ እለ።",
      new String[]{"‘", "‘", "ንኡሽ", " ", "ልዕቤ", " ", "ወእሳት", " ", "ትቅሰን", "፣", " ", "ንኡሽ", " ", "ልዕቤ", " ", "ወእሳት", " ", "ትቅሰን", "’", "’", " ", "እት", " ", "ልብሎ", " ", "ቀንጾ", "፣", " ", "ሐቆ", " ", "እለ", "።"}
    }, {
      "ከእንዴ ትዐቀረት እግለ’ እናስ ትትሀየብ፣ አ’ዳናስ።",
      new String[]{"ከእንዴ", " ", "ትዐቀረት", " ", "እግለ", "’", " ", "እናስ", " ", "ትትሀየብ", "፣", " ", "አ", "’", "ዳናስ", "።"}
    }
    });
  }

  @Test
  public void tokenize() {
    List<String> actual = tokenizer.tokenize(this.input);
    assertArrayEquals(expected, actual.toArray());
  }
}